tutorial/channel/Allrun
#!bin/sh

blockMesh
icoFiberFoam
